{
    "configuration": {
        "setup": {
            "json": "<p>Pathpoint is designed to be customized by the customer.  This is done through a JSON configuration file.  (See our main documentation for a detailed description of the file structure.)</p><ol type='1' style='padding-left: 15px'><li>Download the existing configuration</li><li>Modify it</li><li>Upload & Update it</li></ol><p>This will allow you to keep your JSON configuration in a version control system for save keeping.</p>",
            "json_link_demo": "https://www.youtube.com/watch?v=sp9r6hSWH_o",
            "background": "<p>Pathpoint is a powerful interactive tool that pulls most of its telemetry from real-time NRQL queries.  However for some views like the “Fire Filter”, Pathpoint relies on historical data that is maintained through a background job.</p><ol type='1' style='padding-left: 15px'><li>Use the download link to download a pre-generated Node script.</li><li>Install this script as a synthetics check and the data will be collected continuously.</li></ol><p>You will need to update the script to contain your key information. You may also make customizations to the script as needed, but remember any updates will not be maintained by Pathpoint.   (See our main documentation for a detailed reference on these background jobs.)</p>",
            "background_link": "https://docs.newrelic.com/docs/synthetics/synthetic-monitoring/using-monitors/add-edit-monitors"
        },
        "support": {
            "message_support_01": "Use this form to submit an issue to the Pathpoint development team. We will evaluate your issue and get back to you as soon as possible. Please make sure to provide as much context as possible in your message so we can properly evaluate the root cause and a level of an estimate to resolve it.",
            "options_select_support_02": {
                "service_1": "Data Error - It appears as though the data shown by Pathpoint is not consistent with the telemetry based on other NR1 visualizations.",
                "service_2": "Question or Comment - I have a general question about how Pathpoint works",
                "service_3": "Bug - Something is not working as expected",
                "service_4": "Feature Request - I have a request for a feature that will make my Pathpoint experience ",
                "service_5": "Call Request - We would love to schedule a call with the Pathpoint team to discuss a complex customization request"
            }
        }
    },
    "tooltip": {
        "stages": {
            "message_stages_01": "These are the highest level business stages.   At the actual system level, there will be a rollup of many services and methods.  PathPoint will give us a view of Latency, Utilization, and Errors for each high-level business stage.  The Borderfree customization models the following stages: PRE-PROCESSING, PRE-ORDER, CHECKOUT, ORDER MANAGEMENT, DISTRIBUTION & RETURNS.",
            "message_stages_02": "For each stage, there will be some useful stats shown beneath the stage description.  In addition, there will be an arrow graphic depicting the overall aggregate performance of that stage.  (See our main documentation for how this is computed.)",
            "message_stages_03": "View real-time User or Transaction traffic and measure Congestion by the percentage of a person or process taking longer than expected to go from one stage to the other.    (See our main documentation for how this is computed.)",
            "message_stages_04": "TODO: Congestion definition",
            "message_stages_05": "This shows the level of utilization of infrastructure associated with this stage.  (See our main documentation for how this is computed.)",
            "message_stages_06": "A simple indicator of stage health  This is derived from a set of aggregate signals. (See our main documentation for how this is computed.)"
        },
        "steps": {
            "message_steps_01": "These are 'sub-stages' of a parent stage.  that represent a more granular aggregation of services.  Clicking on a step will highly show more detailed services and functions in the TouchPoints list below.  If a stage has a red border it means there is an error anomaly for this stage.",
            "message_steps_02": "A step is a logical construct.  It is a means of rolling up one or more touchpoints.  Steps are a good middle conceptual ground between the high-level business stage and the touchpoint (which is typically a low-level technological signal).  Steps help you explain system performance to business stakeholders without getting into all of the implementation details.",
            "message_steps_03": "A step is highlighted when clicked by the user to view the related touchpoints, and when a filter is applied."
        },
        "touchpoints": {
            "message_touchpoints_01": "These are the most granular entities in the PathPoint model.  With this version of PathPoint TouchPoints are usually a specific APM or Browser application.  The health status of a TouchPoint will be tied to error rate and latency.",
            "message_touchpoints_02": "In this mode, all touchpoints will be shown.  In some cases, there will be hundreds of touchpoints feeding your Pathpoint and the view can get cluttered.  In some cases, you may wish to view only struggling touchpoints.  Uncheck “view all” to see that view.",
            "message_touchpoints_03": "When you select a step Pathpoint will highlight the related touchpoints.  If healthy they will show with a blue outline.  If struggling they will be outlined in red."
        }
    },
    "button_tools": {
        "canary": {
            "welcome_mat": "When activating the Canary, all states are reset and Pathpoint will only begin to calculate the steps that are activated manually. It is likely to illustrate the specific operation of a particular step.  This is a useful view when you are troubleshooting one step or in the process of a code deployment or system maintenance and want to constrain your view.   If you are running the Pathpoint background job the signals for non-visible touchpoints will still be available with the Flame view.",
            "link_canary": "https://www.youtube.com/watch?v=sp9r6hSWH_o&ab_channel=CodeStepByStep"
        },
        "flame": {
            "welcome_mat": "The Flame filter will highlight the most problematic “Steps and Touchpoints” with a configurable time window and percentile threshold.  The filter will show the worst n percentile of touchpoints.  This is useful in situations where things look okay now but may have had a pattern of errors or latency in the recent past.  This filter requires the installation of a background script that is downloadable from the Pathpoint Setup Menu.",
            "link_flame": "https://www.youtube.com/watch?v=sp9r6hSWH_o&ab_channel=CodeStepByStep"
        }
    },
    "sample_querys": {
        "prc": "SELECT uniqueCount(session) as session FROM PageView WHERE appName='QS' AND name='WebTransaction/Action/'",
        "pcc":"SELECT count(*) from Transaction WHERE appName='QS' AND name LIKE 'WebTransaction/Action/App%'",
        "app": "SELECT filter(apdex(duration, t:0.028), WHERE 1=1) as apdex, filter( max(duration), WHERE 1=1) as response,filter(percentage(count(*), WHERE error is true), WHERE 1=1) as error from Transaction WHERE appName='QS'",
        "frt": "SELECT filter(apdex(duration, t:1), WHERE 1=1) as apdex, filter( max(duration), WHERE 1=1) as response,filter(percentage(count(*), WHERE error is true), WHERE 1=1) as error from PageView WHERE appName='QS'",
        "syn": "SELECT filter(percentage(count(result),WHERE result='SUCCESS'),WHERE 1=1) as success, max(duration) as duration, max(longRunningTasksAvgTime) as request from SyntheticCheck,SyntheticRequest WHERE monitorName='BDB Live person'",
        "wld": "SELECT latest(statusValue) as statusValue FROM WorkloadStatus WHERE entity.name='ACME Banking'"
    },
    "test_query": {
        "wrong": "Incorrect validated",
        "good": "Successfully validated"
    },
    "banner_messages": {
        "banner_messages_left": "Orders:",
        "banner_messages_center": "Total Value:",
        "banner_messages_right": "Avg. Order Value"
    }
}